# ggplot2を読み込む

# 問題3 箱ひげ図
# アヤメの測定データを使って, 横軸Species, 縦軸Sepal.Width
# の箱ひげ図を作る.

# 対象データ(iris)
# 横軸にくる変数の指定
# 縦軸にくる変数の指定
# 箱ひげ図を指定
# タイトルを入れる



# 問題4 散布図
# アヤメの測定データを使って, 横軸Sepal.Width, 縦軸Sepal.Length
# の散布図を作る.

# 対象データ(iris)
# 横軸にくる変数の指定
# 縦軸にくる変数の指定
# 散布図を指定



# 問題5 グラフの重ね合わせ
# fishのデータでヒストグラムとカーネル密度推定を
# 重ね合わせたグラフを作る

# 対象データ(fish)
# x軸とy軸指定
# ヒストグラムの色の濃さとビンを指定
# カーネル密度推定の線の太さ指定
# タイトルを入れる



# 問題6 折れ線グラフ
# データフレームで乱数生成して, 折れ線グラフを作る

# 変数にデータフレームを格納
# col1は1~100
# col2は(100個, 平均0, 標準偏差1)
# 上の乱数を用いた折れ線グラフ


